{
  "aboutBlurb": "I am a Licensed Mental Health Therapist with a passion for helping individuals connect with themselves, their strengths, and joy to live a more balanced and fulfilling life.",
  "aboutContent": "My name is Meaghan Trezza, LMHC, MS, NCC, and my pronouns are she/her/they/them. I identify as a white, neurodivergent, queer female who lives in a bigger body with PCOS. Each of these parts of me contributes to who I am as a person and the therapist that will show up in front of you each week. I have over nine years of experience in the mental health field, working with children, teens, adults, and families with diverse backgrounds and needs. My prior experience includes working on an animal-assisted therapy farm, various community mental health agencies, mobile crisis work, corrections, and wilderness therapy.  \n\nIn my practice, I utilize a combination of person-centered, Somatic Experiencing, existential, self-compassion work, and mindfulness-based interventions. My approach is relational, trauma-informed, and showing up genuine, authentic, and curious in our space together. Due to the known harms that diet culture creates for individuals’ relationships with food and their bodies, I work from an anti-diet perspective. This is a neurodivergent, BIPOC, and LGBTQIA+ safe space.\n\nI specialize in working with:\n\t•\tTrauma\n\t•\tMood disorders (including perinatal mood disorders)\n\t•\tAnxiety\n\t•\tOCD\n\t•\tGrief and loss\n\t•\tHealing from diet culture\n\t•\tDisordered Eating\n\t•\tBody Image issues\n\t•\tBuilding healthy relationships\n\t•\tNavigating life with chronic illness\n\n\nWhen I am not working, I enjoy gardening, weight-lifting, attending drag shows and concerts, camping, and spending time with my partner and our five animals, Aspen, Roscoe, Summer, Beaker, and Ziggy.",
  "licenseNumber": "LH61326897",
  "training": "I have completed Beginner, Intermediate, and Advanced level trainings for Somatic Experiencing from the Somatic Experiencing International Trauma Institute.",
  "education": "I have a bachelor’s degree in psychology and political science from Northern Arizona University and a mental health counseling master’s degree from Prescott College.",
  "quote": "Claiming joy is an act of freedom and power. We owe it to ourselves to actively cultivate it as part of our political practice.",
  "quoteAuthor": "Shamillah Wilson"
}