{
  "title": "You Are Not Alone",
  "description": "Empowering You to Overcome Life's Challenges ",
  "introTitle": "I’m so glad you are here",
  "introDescription": "I am a Licensed Mental Health Therapist in the state of Washington, with over 9 years of experience working with children, teens, adults, and families to navigate a wide range of personal and emotional challenges.\n\nI have a nontraditional approach to the counseling process incorporating a combination of experiential interventions, talk therapy, and somatic work. My approach is eclectic, utilizing a person-centered approach, Somatic Experiencing, self-compassion work, and mindfulness interventions.\n\nMy main priority is safety and building a healthy therapeutic relationship. The biggest factor in creating sustainable change, growth, and healing is a strong therapeutic relationship within the counseling process.    ",
  "quote": "By giving ourselves unconditional kindness and comfort while embracing the human experience, difficult as it is, we avoid destructive patterns of fear, negativity, and isolation.",
  "quoteAuthor": "Kristin Neff",
  "telehealth": "Telehealth has become an increasingly popular option for mental health therapy in recent years, and for good reason. One of the main benefits of telehealth is its convenience—patients can receive therapy from the comfort of their own home, office, or any location with a stable internet connection. \n\nThis flexibility allows for greater scheduling options and eliminates the need for travel time and expenses. Additionally, telehealth removes potential barriers for patients who may have difficulty leaving their home, live in rural areas with limited access to mental health resources, or have physical disabilities. I am experienced in providing telehealth services and I utilize secure and reliable technology to ensure confidentiality and privacy. \n\nContact me today to learn more about the benefits of telehealth and how it can support your mental health needs."
}