{
  "paymentOptions": "Test",
  "quote": "Growth occurs when individuals confront problems, struggle to master them, and through that struggle develop new aspects of their skills, capacities, views about life.",
  "quoteAuthor": "Carl Rogers",
  "phoneConsultation": "I understand that finding the right therapist can be a daunting task. That's why I offer a complimentary 20-minute phone consultation to help you determine if I am the right fit for you. During this consultation, we'll discuss your needs and concerns and answer any questions you may have about our services. ",
  "medicalInsurance": "I am excited to announce that my therapy sessions are now more accessible than ever, as I accept a range of insurance plans, including Blue Cross Blue Shield, Aetna, and Cigna. This expansion in accepted insurances aims to make mental health care more attainable for a wider audience.\n\nIf you are covered under a different insurance provider, there's no need to worry. I offer the convenience of providing reimbursement superbills upon request. These superbills can be submitted to your insurance company for partial or full reimbursement, depending on your specific plan.\n\nTo ensure a smooth and hassle-free experience, I highly recommend consulting with your insurance company before beginning therapy. Understanding the specifics of your coverage, including eligibility and extent of reimbursement for private therapy practice services, is crucial to avoid any unexpected costs or inconveniences.\n\nRemember, investing in your mental health is important, and I am here to support you every step of the way, with a variety of insurance options to ease your journey towards wellbeing.",
  "payments": "I take all major credit and debit cards as forms of payment. I also accept all Healthcare Savings Account debit cards.",
  "cancelationPolicy": "I ask that if you are unable to attend a scheduled session, please call or email me 24-hours before your appointment. Failure to do so will result in a $100 dollar cancellation fee."
}